Repository: pardus/pardus-boot-repair
Catalog: po/*.po
Languages: pt, tr

source: We're unlocking the encrypted device to access the data. This process may take a moment. Please wait while we unlock the device.
pt: Estamos a desbloquear o dispositivo encriptado para aceder aos dados. Este processo pode demorar um pouco. Aguarde enquanto desbloqueamos o dispositivo.
tr: Verilere erişmek için şifrelenmiş cihazın kilidini açıyoruz. Bu işlem biraz zaman alabilir. Cihazın kilidini açarken lütfen bekleyin.

source: An error occurred while unlocking the encrypted device. Please check the password and try again.
pt: Ocorreu um erro ao desbloquear o dispositivo encriptado. Verifique a palavra-passe e tente novamente.
tr: Şifrelenmiş cihazın kilidi açılırken bir hata oluştu. Lütfen parolayı kontrol edin ve tekrar deneyin.

source: No Volume Groups Detected
pt: Não foram detetados grupos de volumes
tr: Hiçbir Birim Grubu Algılanmadı

source: We couldn't find any volume groups on your system. This could indicate an issue with your LVM configuration. Please ensure that your LVM setup is correct.
pt: Não foi possível encontrar nenhum grupo de volumes no seu sistema. Isto pode indicar um problema com a sua configuração LVM. Certifique-se de que a sua configuração LVM está correta.
tr: Sisteminizde herhangi bir birim grubu bulamadık. Bu, LVM yapılandırmanızla ilgili bir sorun olduğunu gösterebilir. Lütfen LVM kurulumunuzun doğru olduğundan emin olun.

source: Select a Volume Group
pt: Selecionar um grupo de volumes
tr: Bir Birim Grubu Seçin

source: No Logical Volumes Detected
pt: Não foram detetados volumes lógicos
tr: Algılanan Mantıksal Birim Yok

source: We couldn't find any logical volumes on your system. This could indicate an issue with your LVM configuration. Please ensure that your LVM setup is correct.
pt: Não foi possível encontrar nenhum volume lógico no seu sistema. Isto pode indicar um problema com a sua configuração LVM. Certifique-se de que a sua configuração LVM está correta.
tr: Sisteminizde herhangi bir mantıksal birim bulamadık. Bu, LVM yapılandırmanızla ilgili bir sorun olduğunu gösterebilir. Lütfen LVM kurulumunuzun doğru olduğundan emin olun.

source: Select a Logical Volume
pt: Selecionar um volume lógico
tr: Bir Mantıksal Bölüm Seçin

source: Enter password
pt: Introduzir a palavra-passe
tr: Parolayı girin

source: Re-enter password
pt: Reintroduzir a palavra-passe
tr: Parolayı yeniden girin

source: Passwords do not match
pt: As palavras-passe não coincidem
tr: Parolalar eşleşmiyor

source: This application requires root privileges to run. Please run it as root.
pt: Esta aplicação requer privilégios de root para ser executada. Execute-a como root.
tr: Bu uygulamanın çalışması için kök ayrıcalıkları gerekir. Lütfen kök olarak çalıştırın.
