Repository: pardus/pardus-boot-repair
Catalog: po/*.po
Languages: pt, tr

source: Pardus Boot Repair
pt: Reparador de arranque Pardus
tr: Pardus Başlangıç Onarma

source: Reinstall GRUB Bootloader
pt: Reinstalar o carregador de arranque GRUB
tr: Grub Önyükleyicisini Yeniden Kur

source: Reinstalls the GRUB bootloader to ensure the system can boot properly.
pt: Reinstala o carregador de arranque GRUB para garantir que o sistema pode arrancar corretamente.
tr: Sistemin düzgün şekilde önyüklenebilmesini sağlamak için GRUB önyükleyicisini yeniden kurar.

source: Reset password
pt: Repor a palavra-passe
tr: Parolayı sıfırla

source: Resets the user account password.
pt: Repõe a palavra-passe da conta de utilizador.
tr: Kullanıcı hesabının parolasını sıfırlar.

source: Fix Broken Packages
pt: Corrigir pacotes corrompidos
tr: Bozuk Paketleri Onar

source: Attempts to repair broken packages.
pt: Tenta reparar pacotes corrompidos.
tr: Bozuk paketleri onarmaya çalışır.

source: Update system
pt: Atualizar o sistema
tr: Sistemi güncelle

source: Updates all installed packages to the latest versions.
pt: Atualiza todos os pacotes instalados para as versões mais recentes.
tr: Kurulu tüm paketleri en son sürümlere günceller.

source: Advanced options
pt: Opções avançadas
tr: Gelişmiş seçenekler

source: Reinstall system, Repair filesystem, Open chroot shell...
pt: Reinstalar o sistema, reparar o sistema de ficheiros, abrir shell chroot...
tr: Sistemi yeniden kur, Dosya sistemi onar, Chroot kabuğunu aç.

source: Main page
pt: Página principal
tr: Ana sayfa

source: Reinstall system
pt: Reinstalar o sistema
tr: Sistemi yeniden kur

source: Completely reinstalls the operating system.
pt: Reinstala completamente o sistema operativo.
tr: İşletim sistemini tamamen yeniden kurar.

source: Repair filesystem
pt: Reparar sistema de ficheiros
tr: Dosya sistemi onar

source: Scans and repairs the filesystem for errors to ensure data integrity.
pt: Analisa e repara o sistema de ficheiros em busca de erros para garantir a integridade dos dados.
tr: Veri bütünlüğünü sağlamak için dosya sistemini hatalara karşı tarar ve onarır.

source: Reset User Configuration
pt: Repor a configuração do utilizador
tr: Kullanıcı yapılandırmasını sıfırla

source: Reverts settings to default, erasing custom user configurations.
pt: Reverte as definições para as predefinições, apagando as configurações personalizadas do utilizador.
tr: Ayarları varsayılana döndürerek özel kullanıcı yapılandırmalarını siler.

source: Extract system logs
pt: Extrair registos do sistema
tr: Sistem günlüklerini çıkart

source: Retrieves system logs for analysis and troubleshooting purposes.
pt: Recupera os registos do sistema para fins de análise e resolução de problemas.
tr: Analiz ve sorun giderme amacıyla sistem günlüklerini alır.

source: Open Chroot Shell
pt: Abrir o shell do chroot
tr: Chroot kabuğunu aç

source: Opens a chroot environment for system maintenance or recovery tasks.
pt: Abre um ambiente chroot para tarefas de manutenção ou recuperação do sistema.
tr: Sistem bakımı veya kurtarma görevleri için bir chroot ortamı açar.

source: Hide logs
pt: Ocultar registos
tr: Günlükleri Gizle

source: Show logs
pt: Mostrar registos
tr: Günlükleri göster

source: Copy logs
pt: Copiar registos
tr: Günlükleri kopyala

source: Continue
pt: Continuar
tr: Sürdür

source: Helps to repair broken systems
pt: Ajuda a reparar sistemas corrompidos
tr: Bozuk sistemlerin onarılmasına yardımcı olur

source: Website
pt: Página Web
tr: Web sitesi

source: This program comes with absolutely no warranty. See the <a href="https://www.gnu.org/licenses/gpl-3.0.html">GNU General Public License, version 3 or later</a> for details.
pt: Este programa vem sem qualquer garantia. Veja a <a href="https://www.gnu.org/licenses/gpl-3.0.html">GNU General Public License, versão 3 ou superior</a> para mais detalhes.
tr: Bu program kesinlikle hiçbir garanti içermemektedir. Ayrıntılar için <a href="https://www.gnu.org/licenses/gpl-3.0.html">GNU Genel Kamu Lisansı, sürüm 3 veya sonrası</a>'na bakın.

source: translator-credits
pt: Hugo Carvalho <hugokarvalho@hotmail.com>
tr: Edip H. <edip@medip.dev>

source: You can't close the application while an operation is in progress. Please wait until the operation is completed.
pt: Não é possível fechar a aplicação enquanto estiver a decorrer uma operação. Aguarde até que a operação seja concluída.
tr: Bir işlem devam ederken uygulamayı kapatamazsınız. Lütfen işlem tamamlanana kadar bekleyin.

source: Processing your request.
pt: A processar o seu pedido.
tr: İsteğiniz işleniyor.

source: We will ask you some questions after we process your request.
pt: Depois de processarmos o seu pedido, colocar-lhe-emos algumas questões.
tr: İsteğinizi işleme koyduktan sonra size bazı sorular soracağız.

source: Do you want to clear efivars?
tr: Efi Değişkenlerini temizlemek istiyor musunuz?

source: On some systems, the BIOS may not detect grub until installed as a removable device. Do you want to install grub as a removable device? You should only say yes if you cannot boot into the system after installation.
tr: Bazı sistemlerde BIOS, GRUB'u ancak çıkarılabilir bir aygıt olarak yüklendiğinde algılayabilir. GRUB'u çıkarılabilir bir aygıt olarak yüklemek istiyor musunuz? Bu seçeneği yalnızca kurulumdan sonra sistemi başlatamıyorsanız seçmelisiniz.

source: Reinstalling GRUB Bootloader
pt: A reinstalar o carregador de arranque GRUB
tr: GRUB önyükleyicisi yeniden kuruluyor

source: We're reinstalling the GRUB boot loader to ensure your system can start up properly. This process may take a few moments. Once complete, your computer should boot into Pardus as usual.
pt: Estamos a reinstalar o carregador de arranque GRUB para garantir que o seu sistema pode arrancar corretamente. Este processo pode demorar alguns momentos. Uma vez concluído, seu computador deve inicializar no Pardus como de costume.
tr: Sisteminizin düzgün bir şekilde başlayabilmesini sağlamak için GRUB önyükleyicisini yeniden kuruyoruz. Bu işlem birkaç dakika sürebilir. İşlem tamamlandığında, Bilgisayarınız her zamanki gibi Pardus'a açılmalıdır.

source: GRUB Successfully Reinstalled
pt: GRUB reinstalado com sucesso
tr: GRUB Başarıyla Yeniden Kuruldu

source: Great news! The GRUB boot loader has been successfully reinstalled on your system. You're all set to restart your computer and resume normal operation.
pt: Ótimas notícias! O carregador de arranque GRUB foi reinstalado com sucesso no seu sistema. Está tudo pronto para reiniciar o seu computador e retomar o funcionamento normal.
tr: Harika bir haber! GRUB önyükleyicisi sisteminize başarıyla yeniden yüklendi. Bilgisayarınızı yeniden başlatmaya ve normal çalışmaya devam etmeye hazırsınız.

source: Fixing Broken Packages
pt: A corrigir pacotes corrompidos
tr: Bozuk Paketler Onarılıyor

source: We're resolving issues with broken packages on your system to ensure everything works. This may take some time, but we're on it. Once complete, your system should be stable and ready for use.
pt: Estamos a resolver problemas com pacotes corrompidos no seu sistema para garantir que tudo funciona. Isto pode demorar algum tempo, mas estamos a tratar disso. Uma vez concluído, o seu sistema deverá estar estável e pronto a ser utilizado.
tr: Her şeyin çalıştığından emin olmak için sisteminizdeki bozuk paketlerle ilgili sorunları çözüyoruz. Bu biraz zaman alabilir, ancak üzerinde çalışıyoruz. Tamamlandığında, sisteminiz kararlı ve kullanıma hazır olmalıdır.

source: Packages Repaired
pt: Pacotes reparados
tr: Paketler Onarıldı

source: Great news! The broken packages on your system have been successfully repaired.
pt: Ótimas notícias! Os pacotes corrompidos no seu sistema foram reparados com sucesso.
tr: Harika haber! Sisteminizdeki bozuk paketler başarıyla onarıldı.

source: Enter new password
pt: Introduza a nova palavra-passe
tr: Yeni parola girin

source: Resetting password
pt: A repor palavra-passe
tr: Parola sıfırlanıyor

source: We're resetting your password to provide access to your account. This process will only take a moment. Once complete, you'll be able to log in with your new password into your Pardus system.
pt: Estamos a repor a sua palavra-passe para permitir o acesso à sua conta. Este processo demora apenas um momento. Uma vez concluído, poderá iniciar sessão com a sua nova palavra-passe no seu sistema Pardus.
tr: Hesabınıza erişim sağlamak için parolanızı sıfırlıyoruz. Bu işlem sadece bir dakika sürecektir. İşlem tamamlandığında yeni parolanızla Pardus sisteminize giriş yapabileceksiniz.

source: Password Reset Completed
pt: Reposição de palavra-passe concluída
tr: Parola Sıfırlama Tamamlandı

source: Your password has been successfully reset. You can now log in to your account with the new password.
pt: A sua palavra-passe foi reposta com sucesso. Pode agora iniciar sessão na sua conta com a nova palavra-passe.
tr: Parolanız başarıyla sıfırlandı. Artık yeni parolanızla hesabınıza giriş yapabilirsiniz.

source: Updating Software Packages
pt: A atualizar pacotes de software
tr: Yazılım Paketleri Güncelleniyor

source: We're currently updating the software packages on your system to ensure you have the latest features and security enhancements. This process may take some time depending on the number of updates available. Please be patient.
pt: Estamos atualmente a atualizar os pacotes de software no seu sistema para garantir que dispõe das funcionalidades e melhorias de segurança mais recentes. Este processo pode demorar algum tempo, dependendo do número de atualizações disponíveis. Seja paciente.
tr: En son özelliklere ve güvenlik geliştirmelerine sahip olmanızı sağlamak için şu anda sisteminizdeki yazılım paketlerini güncelliyoruz. Bu süreç, mevcut güncellemelerin sayısına bağlı olarak biraz zaman alabilir. Lütfen sabırlı olun.

source: Software Packages Updated
pt: Pacotes de software atualizados
tr: Yazılım Paketleri güncellendi

source: Your system's software packages have been successfully updated. You now have the latest features and security patches installed.
pt: Os pacotes de software do seu sistema foram atualizados com sucesso. Tem agora instaladas as funcionalidades e as correções de segurança mais recentes.
tr: Sisteminizin yazılım paketleri başarıyla güncellendi. Artık en son özellikler ve güvenlik yamaları yüklü.

source: System Reinstallation
pt: Reinstalação do sistema
tr: Sistem Yeniden Kurulumu

source: We're performing a clean reinstall of your system to ensure a fresh start. This process will reset your system to its original state, removing all applications.
pt: Estamos a efetuar uma reinstalação limpa do seu sistema para garantir um novo começo. Este processo irá repor o seu sistema no seu estado original, removendo todas as aplicações.
tr: Yeni bir başlangıç yapmak için sisteminizi temiz bir şekilde yeniden kuruyoruz. Bu işlem, tüm uygulamaları kaldırarak sisteminizi varsayılan durumuna sıfırlayacaktır.

source: System Reinstallation Completed
pt: Reinstalação do sistema concluída
tr: Sistem Yeniden Kurulumu Tamamlandı

source: Your system has been successfully reinstalled. Everything is now fresh and ready for you.
pt: O seu sistema foi reinstalado com sucesso. Tudo está agora novo e pronto para si.
tr: Sisteminiz başarıyla yeniden yüklendi. Artık her şey temiz ve sizin için hazır.

source: Detecting Partitions
pt: A detetar partições
tr: Bölümler Algılanıyor

source: We're scanning your system to locate available partitions.
pt: Estamos a analisar o seu sistema para localizar partições disponíveis.
tr: Mevcut bölümleri bulmak için sisteminizi tarıyoruz.

source: Unable to Detect Partitions
pt: Não foi possível detetar partições
tr: Bölümler Algılanamıyor

source: We couldn't find any partitions on your system. This could indicate a problem with your disk or partition table. Please double-check your disk connections and configuration.
pt: Não foi possível encontrar nenhuma partição no seu sistema. Isto pode indicar um problema com o seu disco ou tabela de partições. Verifique novamente as ligações e a configuração do disco.
tr: Sisteminizde herhangi bir bölüm bulamadık. Bu, diskinizde veya bölümleme tablonuzda bir sorun olduğunu gösterebilir. Lütfen disk bağlantılarınızı ve yapılandırmanızı iki kez kontrol edin.

source: Choose Partition for Filesystem Repair
pt: Escolher a partição para reparação do sistema de ficheiros
tr: Dosya Sistemi Onarımı için Bölüm Seçin

source: Repairing Filesystem on {}
pt: A reparar o sistema de ficheiros em {}
tr: {} Üzerindeki Dosya Sistemi Onarılıyor

source: We're currently repairing the filesystem on the selected partition. This process may take some time, depending on the size and severity of the issues found. Please be patient while we work to restore the partition's functionality.
pt: Estamos atualmente a reparar o sistema de ficheiros na partição selecionada. Este processo pode demorar algum tempo, dependendo do tamanho e da gravidade dos problemas encontrados. Seja paciente enquanto trabalhamos para restaurar a funcionalidade da partição.
tr: Şu anda seçilen bölümdeki dosya sistemini onarıyoruz. Bu işlem, bulunan sorunların boyutuna ve ciddiyetine bağlı olarak biraz zaman alabilir. Bölümün işlevselliğini geri kazandırmaya çalışırken lütfen sabırlı olun.

source: Filesystem Repair Successful
pt: Reparação do sistema de ficheiros bem sucedida
tr: Dosya Sistemi Onarımı Başarılı

source: The filesystem has been successfully repaired. Your data should now be accessible without any issues.
pt: O sistema de ficheiros foi reparado com sucesso. Os seus dados devem agora estar acessíveis sem quaisquer problemas.
tr: Dosya sistemi başarıyla onarıldı. Verileriniz artık herhangi bir sorun olmadan erişilebilmelidir.

source: Resetting User Settings
pt: A repor as definições do utilizador
tr: Kullanıcı Ayarları Sıfırlanıyor

source: We're resetting your user configuration to its default state. This will revert any custom settings back to their original values. Please note that any personalized preferences will be lost. Once complete, your system will be refreshed and ready for use.
pt: Estamos a repor a configuração do utilizador no seu estado predefinido. Isto irá reverter quaisquer definições personalizadas para os seus valores originais. Tenha em atenção que quaisquer preferências personalizadas serão perdidas. Uma vez concluído, o seu sistema será atualizado e estará pronto a ser utilizado.
tr: Kullanıcı yapılandırmanızı varsayılan durumuna sıfırlıyoruz. Bu, tüm özel ayarları varsayılan değerlerine geri döndürecektir. Kişiselleştirilmiş tercihlerin kaybolacağını lütfen unutmayın. İşlem tamamlandığında sisteminiz yenilenmiş ve kullanıma hazır olacaktır.

source: Configuration Reset Completed
pt: Reposição da configuração concluída
tr: Yapılandırma Sıfırlaması Tamamlandı

source: Great news! Your user configuration has been successfully reset to its default settings.
pt: Ótimas notícias! A sua configuração de utilizador foi reposta com sucesso nas predefinições.
tr: Harika haber! Kullanıcı yapılandırmanız başarıyla varsayılan ayarlarına sıfırlandı.

source: Extracting System Logs
pt: A extrair registos do sistema
tr: Sistem Günlükleri Çıkarılıyor

source: We're collecting important system logs and placing them in the '{}' directory as you requested. These logs contain helpful information about your system's activity and any issues it may be experiencing. Depending on how much information there is, this might take a little time. Thanks for waiting while we gather this data.
pt: Estamos a recolher registos importantes do sistema e a colocá-los no diretório '{}', conforme solicitado. Estes registos contêm informações úteis sobre a atividade do seu sistema e quaisquer problemas que este possa ter. Dependendo da quantidade de informação existente, isto pode demorar algum tempo. Obrigado por aguardar enquanto reunimos esses dados.
tr: Önemli sistem günlüklerini topluyor ve talep ettiğiniz gibi '{}' dizinine yerleştiriyoruz. Bu günlükler, sisteminizin etkinliği ve karşılaşabileceği sorunlar hakkında yararlı bilgiler içerir. Ne kadar bilgi olduğuna bağlı olarak bu işlem biraz zaman alabilir. Biz bu verileri toplarken beklediğiniz için teşekkür ederiz.

source: System Logs Extracted
pt: Registos do sistema extraídos
tr: Sistem Günlükleri Çıkarıldı

source: Great news! The system logs have been successfully extracted. This valuable information can help diagnose any issues with your system.
pt: Ótimas notícias! Os registos do sistema foram extraídos com sucesso. Esta informação valiosa pode ajudar a diagnosticar quaisquer problemas com o seu sistema.
tr: Haberler harika! Sistem günlükleri başarıyla çıkarıldı. Bu değerli bilgiler, sisteminizle ilgili herhangi bir sorunun teşhis edilmesine yardımcı olabilir.

source: Entering Chroot Environment
pt: Entrando no ambiente chroot
tr: Chroot Ortamına Giriliyor

source: We're accessing a special system environment called chroot at your request. This allows you to make changes as if you were working directly on your installed operating system. Please wait while we set up this environment to address your needs.
pt: Estamos a aceder a um ambiente de sistema especial chamado chroot a seu pedido. Isto permite-lhe fazer alterações como se estivesse a trabalhar diretamente no seu sistema operativo instalado. Aguarde enquanto configuramos este ambiente para atender às suas necessidades.
tr: İsteğiniz üzerine chroot adı verilen özel bir sistem ortamına erişiyoruz. Bu, doğrudan kurulu işletim sisteminiz üzerinde çalışıyormuş gibi değişiklikler yapmanıza olanak tanır. İhtiyaçlarınızı karşılamak için bu ortamı kurarken lütfen bekleyin.

source: Chroot Process Successfully Concluded
pt: Processo chroot concluído com sucesso
tr: Chroot İşlemi Başarıyla Sonuçlandı

source: The chroot process has finished successfully
pt: O processo de chroot foi concluído com sucesso
tr: Chroot işlemi başarıyla tamamlandı

source: Are you sure you want to continue? This action is irreversible and may cause data loss.
pt: Tem a certeza de que pretende continuar? Esta ação é irreversível e pode causar perda de dados.
tr: Devam etmek istediğinize emin misiniz? Bu işlem geri alınamaz ve veri kaybına neden olabilir.

source: Operation Cancelled
pt: Operação cancelada
tr: İşlem iptal edildi

source: The operation has been cancelled by the user.
pt: A operação foi cancelada pelo utilizador.
tr: İşlem kullanıcı tarafından iptal edildi.

source: An error occured
pt: Ocorreu um erro
tr: Bir hata oluştu

source: An error occurred before the command has been executed
pt: Ocorreu um erro antes de o comando ter sido executado
tr: Komut çalıştırılmadan önce bir hata oluştu

source: An error occured while executing the command. Please check the logs
pt: Ocorreu um erro durante a execução do comando. Verifique os registos
tr: Komut çalıştırılırken bir hata oluştu. Lütfen günlükleri kontrol edin

source: An error occurred after the command has been executed.
pt: Ocorreu um erro depois de o comando ter sido executado.
tr: Komut çalıştırıldıktan sonra bir hata oluştu.

source: Root Filesystem Missing
pt: Sistema de ficheiros root em falta
tr: Kök Dosya Sistemi Eksik

source: We couldn't locate the root filesystem on your system. This could be due to a disk failure, misconfiguration, or other issues. Please ensure that your disk is properly connected and configured.
pt: Não foi possível localizar o sistema de ficheiros root no seu sistema. Isto pode dever-se a uma falha no disco, a uma configuração incorreta ou a outros problemas. Certifique-se de que o seu disco está corretamente ligado e configurado.
tr: Sisteminizdeki kök dosya sistemini bulamadık. Bunun nedeni disk arızası, yanlış yapılandırma veya diğer sorunlar olabilir. Lütfen diskinizin doğru şekilde bağlandığından ve yapılandırıldığından emin olun.

source: Select a root filesystem
pt: Selecionar um sistema de ficheiros root
tr: Bir kök dosya sistemi seçin

source: Root Filesystem Chosen
pt: Sistema de ficheiros root escolhido
tr: Kök Dosya Sistemi Seçildi

source: You've selected the root filesystem for further action.
pt: Selecionou o sistema de ficheiros root para ações futuras.
tr: Sonraki işlem için kök dosya sistemini seçtiniz.

source: No Users Detected
pt: Nenhum utilizador detetado
tr: Algılanan Kullanıcı Yok

source: We couldn't find any users on your system. This could indicate an issue with user accounts or system configuration. Please ensure that users are properly configured.
pt: Não foi possível encontrar nenhum utilizador no seu sistema. Isto pode indicar um problema com as contas de utilizador ou com a configuração do sistema. Certifique-se de que os utilizadores estão corretamente configurados.
tr: Sisteminizde herhangi bir kullanıcı bulamadık. Bu, kullanıcı hesapları veya sistem yapılandırmasıyla ilgili bir sorun olduğunu gösterebilir. Lütfen kullanıcıların düzgün yapılandırıldığından emin olun.

source: Select a user
pt: Selecionar um utilizador
tr: Bir kullanıcı seçin

source: User Chosen
pt: Utilizador escolhido
tr: Kullanıcı seçildi

source: You've selected a user for further action. This step is important for making changes specific to the chosen user.
pt: Selecionou um utilizador para ações futuras. Este passo é importante para efetuar alterações específicas ao utilizador selecionado.
tr: Sonraki işlem için bir kullanıcı seçtiniz. Bu adım, seçilen kullanıcıya özel değişiklikler yapmak için önemlidir.

source: Master Boot Record (MBR) Missing
pt: Master Boot Record (MBR) em falta
tr: Ana Önyükleme Kaydı (MBR) Eksik

source: We couldn't locate the Master Boot Record (MBR) on your system. This critical component is necessary for booting your system. Please check your disk connections and configuration.
pt: Não foi possível localizar o Master Boot Record (MBR) no seu sistema. Este componente crítico é necessário para arrancar o seu sistema. Verifique as ligações e a configuração do disco.
tr: Sisteminizde Ana Önyükleme Kaydını (MBR) bulamadık. Bu kritik bileşen sisteminizin önyüklenmesi için gereklidir. Lütfen disk bağlantılarınızı ve yapılandırmanızı kontrol edin.

source: Select the Master Boot Record (MBR)
pt: Selecionar o Master Boot Record (MBR)
tr: Ana Önyükleme Kaydını (MBR) seçin

source: MBR chosen
pt: MBR escolhido
tr: MBR seçildi

source: You've successfully selected the Master Boot Record (MBR). This selection is essential for configuring your system's boot process.
pt: Seleccionou com sucesso o Master Boot Record (MBR). Esta seleção é essencial para configurar o processo de arranque do seu sistema.
tr: Ana Önyükleme Kaydını (MBR) başarıyla seçtiniz. Bu seçim, sisteminizin önyükleme işlemini yapılandırmak için çok önemlidir.

source: Searching for Btrfs Root Filesystem Subvolume
pt: A pesquisar o subvolume do sistema de ficheiros root Btrfs
tr: Btrfs Kök Dosya Sistemi Alt Birimi Aranıyor

source: We're searching for the Btrfs root filesystem subvolume on your system. This is essential for proper system operation. Please wait while we locate the Btrfs root filesystem subvolume. Thank you for your patience.
pt: Estamos a procurar o subvolume do sistema de ficheiros root Btrfs no seu sistema. Isto é essencial para o funcionamento correto do sistema. Aguarde enquanto localizamos o subvolume do sistema de ficheiros root Btrfs. Obrigado pela sua paciência.
tr: Sisteminizde Btrfs kök dosya sistemi alt birimini arıyoruz. Bu, sistemin düzgün çalışması için gereklidir. Btrfs kök dosya sistemi alt birimini bulana kadar lütfen bekleyin. Sabrınız için teşekkür ederiz.

source: Enter LUKS Password
pt: Introduzir a palavra-passe LUKS
tr: LUKS parolasını girin

source: Unlocking Encrypted Device
pt: Desbloquear dispositivo encriptado
tr: Şifrelenmiş Cihazın Kilidi Açılıyor
